mediaMicroservices/wrk2/rebuttal_results/single_phone/1phone_60s_r200.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 848.072ms, rate sampling interval: 3461ms
  Thread calibration: mean lat.: 926.304ms, rate sampling interval: 2809ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.23s     2.46s   10.95s    64.58%
    Req/Sec    85.97      4.44    90.00     93.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.73s 
 75.000%    5.94s 
 90.000%    7.67s 
 99.000%   10.95s 
 99.900%   11.60s 
 99.990%   11.67s 
 99.999%   11.68s 
100.000%   11.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     150.527     0.000000            1         1.00
    1309.695     0.100000          868         1.11
    1978.367     0.200000         1732         1.25
    2576.383     0.300000         2598         1.43
    3188.735     0.400000         3464         1.67
    3725.311     0.500000         4330         2.00
    4132.863     0.550000         4763         2.22
    4554.751     0.600000         5195         2.50
    5062.655     0.650000         5629         2.86
    5443.583     0.700000         6062         3.33
    5939.199     0.750000         6492         4.00
    6209.535     0.775000         6709         4.44
    6483.967     0.800000         6926         5.00
    6807.551     0.825000         7142         5.71
    7110.655     0.850000         7358         6.67
    7426.047     0.875000         7578         8.00
    7536.639     0.887500         7690         8.89
    7667.711     0.900000         7793        10.00
    7823.359     0.912500         7899        11.43
    8044.543     0.925000         8008        13.33
    8196.095     0.937500         8115        16.00
    8331.263     0.943750         8173        17.78
    8421.375     0.950000         8227        20.00
    8585.215     0.956250         8278        22.86
    8978.431     0.962500         8332        26.67
    9437.183     0.968750         8387        32.00
    9543.679     0.971875         8414        35.56
    9814.015     0.975000         8440        40.00
   10035.199     0.978125         8468        45.71
   10436.607     0.981250         8495        53.33
   10641.407     0.984375         8521        64.00
   10715.135     0.985938         8539        71.11
   10747.903     0.987500         8548        80.00
   10854.399     0.989062         8563        91.43
   11157.503     0.990625         8575       106.67
   11304.959     0.992188         8589       128.00
   11354.111     0.992969         8596       142.22
   11378.687     0.993750         8602       160.00
   11419.647     0.994531         8609       182.86
   11444.223     0.995313         8616       213.33
   11493.375     0.996094         8623       256.00
   11509.759     0.996484         8627       284.44
   11526.143     0.996875         8629       320.00
   11550.719     0.997266         8633       365.71
   11558.911     0.997656         8640       426.67
   11558.911     0.998047         8640       512.00
   11567.103     0.998242         8641       568.89
   11583.487     0.998437         8645       640.00
   11583.487     0.998633         8645       731.43
   11599.871     0.998828         8647       853.33
   11608.063     0.999023         8651      1024.00
   11608.063     0.999121         8651      1137.78
   11608.063     0.999219         8651      1280.00
   11608.063     0.999316         8651      1462.86
   11608.063     0.999414         8651      1706.67
   11649.023     0.999512         8652      2048.00
   11657.215     0.999561         8653      2275.56
   11657.215     0.999609         8653      2560.00
   11665.407     0.999658         8654      2925.71
   11665.407     0.999707         8654      3413.33
   11665.407     0.999756         8654      4096.00
   11673.599     0.999780         8655      4551.11
   11673.599     0.999805         8655      5120.00
   11673.599     0.999829         8655      5851.43
   11673.599     0.999854         8655      6826.67
   11673.599     0.999878         8655      8192.00
   11681.791     0.999890         8656      9102.22
   11681.791     1.000000         8656          inf
#[Mean    =     4230.812, StdDeviation   =     2457.031]
#[Max     =    11673.600, Total count    =         8656]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10405 requests in 1.00m, 1.83MB read
Requests/sec:    173.40
Transfer/sec:     31.16KB