mediaMicroservices/wrk2/rebuttal_results/single_phone/1phone_60s_r25.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 45.813ms, rate sampling interval: 151ms
  Thread calibration: mean lat.: 45.323ms, rate sampling interval: 163ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    48.17ms   23.33ms 122.69ms   77.12%
    Req/Sec    11.63      9.09    36.00     68.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   43.17ms
 75.000%   56.19ms
 90.000%   81.54ms
 99.000%  122.69ms
 99.900%  180.86ms
 99.990%  269.82ms
 99.999%  269.82ms
100.000%  269.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      17.119     0.000000            1         1.00
      25.711     0.100000          120         1.11
      29.823     0.200000          239         1.25
      34.559     0.300000          361         1.43
      39.103     0.400000          480         1.67
      43.167     0.500000          598         2.00
      45.055     0.550000          657         2.22
      47.103     0.600000          716         2.50
      49.407     0.650000          776         2.86
      52.351     0.700000          836         3.33
      56.191     0.750000          895         4.00
      58.047     0.775000          925         4.44
      61.087     0.800000          955         5.00
      65.439     0.825000          985         5.71
      69.823     0.850000         1015         6.67
      75.071     0.875000         1044         8.00
      77.951     0.887500         1060         8.89
      81.535     0.900000         1074        10.00
      84.351     0.912500         1089        11.43
      87.871     0.925000         1105        13.33
      92.095     0.937500         1119        16.00
      94.719     0.943750         1126        17.78
      96.255     0.950000         1134        20.00
      99.775     0.956250         1141        22.86
     102.015     0.962500         1149        26.67
     104.127     0.968750         1156        32.00
     105.023     0.971875         1160        35.56
     105.215     0.975000         1164        40.00
     105.791     0.978125         1167        45.71
     106.687     0.981250         1171        53.33
     112.831     0.984375         1175        64.00
     113.663     0.985938         1177        71.11
     118.015     0.987500         1179        80.00
     120.319     0.989062         1180        91.43
     122.879     0.990625         1182       106.67
     127.103     0.992188         1184       128.00
     127.615     0.992969         1185       142.22
     130.879     0.993750         1186       160.00
     134.911     0.994531         1187       182.86
     136.703     0.995313         1188       213.33
     138.111     0.996094         1189       256.00
     138.111     0.996484         1189       284.44
     139.647     0.996875         1190       320.00
     139.647     0.997266         1190       365.71
     141.311     0.997656         1191       426.67
     141.311     0.998047         1191       512.00
     141.311     0.998242         1191       568.89
     180.863     0.998437         1192       640.00
     180.863     0.998633         1192       731.43
     180.863     0.998828         1192       853.33
     180.863     0.999023         1192      1024.00
     180.863     0.999121         1192      1137.78
     269.823     0.999219         1193      1280.00
     269.823     1.000000         1193          inf
#[Mean    =       48.173, StdDeviation   =       23.330]
#[Max     =      269.568, Total count    =         1193]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1454 requests in 1.00m, 261.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:     24.23
Transfer/sec:      4.35KB