mediaMicroservices/wrk2/rebuttal_results/single_phone/1phone_60s_r50.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 34.644ms, rate sampling interval: 100ms
  Thread calibration: mean lat.: 36.329ms, rate sampling interval: 107ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    41.86ms   29.01ms 164.86ms   90.90%
    Req/Sec    24.47     17.25    70.00     74.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.53ms
 75.000%   48.45ms
 90.000%   68.61ms
 99.000%  164.86ms
 99.900%  278.53ms
 99.990%  284.42ms
 99.999%  284.42ms
100.000%  284.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      15.583     0.000000            1         1.00
      20.991     0.100000          248         1.11
      23.567     0.200000          494         1.25
      26.335     0.300000          740         1.43
      29.695     0.400000          985         1.67
      33.535     0.500000         1232         2.00
      35.871     0.550000         1355         2.22
      38.079     0.600000         1478         2.50
      40.863     0.650000         1602         2.86
      43.807     0.700000         1724         3.33
      48.447     0.750000         1847         4.00
      50.687     0.775000         1909         4.44
      53.279     0.800000         1970         5.00
      55.807     0.825000         2032         5.71
      58.719     0.850000         2093         6.67
      62.399     0.875000         2155         8.00
      65.439     0.887500         2187         8.89
      68.607     0.900000         2217        10.00
      71.551     0.912500         2247        11.43
      74.687     0.925000         2278        13.33
      80.831     0.937500         2309        16.00
      84.927     0.943750         2325        17.78
      89.663     0.950000         2339        20.00
      95.231     0.956250         2355        22.86
     101.119     0.962500         2370        26.67
     114.559     0.968750         2386        32.00
     121.279     0.971875         2393        35.56
     129.343     0.975000         2401        40.00
     138.111     0.978125         2409        45.71
     141.311     0.981250         2416        53.33
     155.647     0.984375         2424        64.00
     159.231     0.985938         2428        71.11
     162.303     0.987500         2432        80.00
     164.735     0.989062         2436        91.43
     168.831     0.990625         2439       106.67
     175.103     0.992188         2443       128.00
     177.791     0.992969         2445       142.22
     182.143     0.993750         2447       160.00
     185.215     0.994531         2449       182.86
     196.735     0.995313         2451       213.33
     231.551     0.996094         2453       256.00
     246.143     0.996484         2454       284.44
     252.415     0.996875         2455       320.00
     253.695     0.997266         2456       365.71
     260.863     0.997656         2457       426.67
     263.423     0.998047         2458       512.00
     263.423     0.998242         2458       568.89
     269.311     0.998437         2459       640.00
     269.311     0.998633         2459       731.43
     278.527     0.998828         2460       853.33
     278.527     0.999023         2460      1024.00
     278.527     0.999121         2460      1137.78
     281.855     0.999219         2461      1280.00
     281.855     0.999316         2461      1462.86
     281.855     0.999414         2461      1706.67
     281.855     0.999512         2461      2048.00
     281.855     0.999561         2461      2275.56
     284.415     0.999609         2462      2560.00
     284.415     1.000000         2462          inf
#[Mean    =       41.859, StdDeviation   =       29.010]
#[Max     =      284.160, Total count    =         2462]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2999 requests in 1.00m, 538.88KB read
Requests/sec:     49.98
Transfer/sec:      8.98KB